In [15]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [16]:
data = pd.read_csv("Data.CSV")
print(data.head(10))

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [18]:
print(data.head(10))

   Country   Age   Salary Purchased  new
0   France  44.0  72000.0        No  4.4
1    Spain  27.0  48000.0       Yes  2.7
2  Germany  30.0  54000.0        No  3.0
3    Spain  38.0  61000.0        No  3.8
4  Germany  40.0      NaN       Yes  4.0
5   France  35.0  58000.0       Yes  3.5
6    Spain   NaN  52000.0        No  NaN
7   France  48.0  79000.0       Yes  4.8
8  Germany  50.0  83000.0        No  5.0
9   France  37.0  67000.0       Yes  3.7

In [17]:
data['new'] = data['Age'] /10

In [57]:
from sklearn.preprocessing import Imputer

In [20]:
def nameoffunction(a):
    print(a,type(a))
    return a * 4

In [21]:
python -m pip install geopy

SyntaxError: invalid syntax (<ipython-input-21-21cc31950198>, line 1)

In [22]:
data['new3'] = nameoffunction(data['Purchased'])
data

0     No
1    Yes
2     No
3     No
4    Yes
5    Yes
6     No
7    Yes
8     No
9    Yes
Name: Purchased, dtype: object <class 'pandas.core.series.Series'>

   Country   Age   Salary Purchased  new          new3
0   France  44.0  72000.0        No  4.4      NoNoNoNo
1    Spain  27.0  48000.0       Yes  2.7  YesYesYesYes
2  Germany  30.0  54000.0        No  3.0      NoNoNoNo
3    Spain  38.0  61000.0        No  3.8      NoNoNoNo
4  Germany  40.0      NaN       Yes  4.0  YesYesYesYes
5   France  35.0  58000.0       Yes  3.5  YesYesYesYes
6    Spain   NaN  52000.0        No  NaN      NoNoNoNo
7   France  48.0  79000.0       Yes  4.8  YesYesYesYes
8  Germany  50.0  83000.0        No  5.0      NoNoNoNo
9   France  37.0  67000.0       Yes  3.7  YesYesYesYes

In [29]:
# X = data.iloc[:,1:3]

In [30]:
# print(X)

    Age   Salary
0  44.0  72000.0
1  27.0  48000.0
2  30.0  54000.0
3  38.0  61000.0
4  40.0      NaN
5  35.0  58000.0
6   NaN  52000.0
7  48.0  79000.0
8  50.0  83000.0
9  37.0  67000.0

In [54]:
# imputerobj = Imputer(missing_values= 'NaN',strategy="median",axis= 0)
# print(imputerobj)

Imputer(axis=0, copy=True, missing_values='NaN', strategy='median', verbose=0)

In [55]:
# imputer = imputerobj.fit(X)

In [56]:
# data.iloc[:,1:3] = imputer.transform(X)

In [53]:
# data

   Country        Age        Salary Purchased
0   France  44.000000  72000.000000        No
1    Spain  27.000000  48000.000000       Yes
2  Germany  30.000000  54000.000000        No
3    Spain  38.000000  61000.000000        No
4  Germany  40.000000  63777.777778       Yes
5   France  35.000000  58000.000000       Yes
6    Spain  38.777778  52000.000000        No
7   France  48.000000  79000.000000       Yes
8  Germany  50.000000  83000.000000        No
9   France  37.000000  67000.000000       Yes

In [59]:
X = data[['Age','Salary']]

In [60]:
X

    Age   Salary
0  44.0  72000.0
1  27.0  48000.0
2  30.0  54000.0
3  38.0  61000.0
4  40.0      NaN
5  35.0  58000.0
6   NaN  52000.0
7  48.0  79000.0
8  50.0  83000.0
9  37.0  67000.0

In [61]:
imputerobj2 = Imputer(missing_values="NaN",strategy='median',axis = 0)

In [62]:
data[['Age','Salary']] = imputerobj2.fit_transform(X)

In [63]:
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0  61000.0       Yes
5   France  35.0  58000.0       Yes
6    Spain  38.0  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes